package com.example.myapplication.models;

import android.content.Context;

import java.util.ArrayList;
import java.util.List;

public class Utils {
    public static List<Books> getBooks(Context context) {
        List<Books> books = new ArrayList<>();

//        books.add(new Books(
//                "https://static.arageek.com/wp-content/uploads/2019/01/%D9%83%D8%AA%D8%A7%D8%A8-%D8%A3%D8%AD%D8%A8%D8%A8%D8%AA-%D9%88%D8%BA%D8%AF%D9%8B%D8%A7.jpg"
//                , "أحببت وغدًا\n"
//                , "عماد رشاد عثمان\n" +
//                "\n"
//                , "هذه مروة، سنها عشرون سنة \n" +
//                "\n" +
//                "دائمًا ما تنتظر الفارس الذي سيحررها من الساحر الشرير، ويخطفها على حصانه، ويعيشان معًا سعيدين للأبد، وفي أغلب الأحوال الساحر الشرير في حياتها هو والدها الذي يفرض سلطته عليها ولا يشارك الأسرةَ حياتَها.\n" +
//                " ظلّت مروة تنتظر الرجل الذي سيحتويها وقد أخذت كل تصوراتها عن الحب من أميرات أفلام \"ديزني\"، لكن أضافت إليهنّ بعض المثالية وتمسّكًا شديدًا بتصوراتها حتى انجذبت إلى حسام وتم الزواج.\n" +
//                " وفجأة فتر حبهما وأحست مروة أنها تتعرض إلى الأذى من حسام الذي يحب ذاته أكثر من أي شيء ويأخذ منها الحب دون أن يبادلها نفس الشعور، ولا يقبل أي نقد أو عتاب وإن أخطأ، فكانت النتيجة أن مروة وحسامًا يترك كل منهما الآخر تارَة ويرجعان تارَة أخرى، واستمرا على هذه الحال حتى وجدت مروة نفسها في علاقة غير مريحة وهي غير قادرة على إنهائها.\n" +
//                " فتعالوا نعرف متى بدأت هذه القصة ولِمَ وكيف بدأت، ونعرف كيف تستطيع مروة الخروج من هذه العلاقة هي وكل من تأذّى من شريك حياته."
//                ,"https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%A7%D9%84%D8%AA%D8%B9%D8%A7%D9%81%D9%8A%20%D9%85%D9%86%20%D8%A7%D9%84%D8%B9%D9%84%D8%A7%D9%82%D8%A7%D8%AA%20%D8%A7%D9%84%D9%85%D8%A4%D8%B0%D9%8A%D8%A9%20--%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%A3%D8%AD%D8%A8%D8%A8%D8%AA%20%D9%88%D8%BA%D8%AF%D9%8B%D8%A7%20--%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=2013e325-07bf-426a-a722-c0f6a4ac5651"
//                , false));
        books.add(new Books("https://bel3raby.org/books/wp-content/uploads/2020/02/%D8%AA%D8%AD%D9%85%D9%8A%D9%84-%D9%83%D8%AA%D8%A7%D8%A8-%D8%A7%D9%84%D9%83%D9%84%D8%A8-%D8%A7%D9%84%D8%A3%D8%B3%D9%88%D8%AF-pdf-%E2%80%93-%D9%85%D8%AD%D9%85%D8%AF-%D8%A7%D9%84%D8%B4%D8%A7%D9%85%D9%8A.jpg"
                , "الكلب الأسود"
                , "محمد الشامي"
                , "تخيل معي يا محمود.. واسمح لي أن أسميك محمود.. أنك تعيش قبل الخمسينيات.. قبل أن يبدأ المجال الطبي في الاقتناع بأن المرض النفسي يعالج بأدوية.. وكنت أنت للأسف مريضًا بالاكتئاب.. تشعر بأنه لا جدوى من الحياة.. حزين دائمًا ولا تملك طاقة لأي شيء.. في ظنك كيف كانوا سيعالجونك من دون أدوية؟\n" +
                "\n" +
                "المرضى وقتها كانوا يعالجون عن طريق إزالة جزء من الفص الجبهي في الدماغ.. أو مثلًا بفتح الجمجمة وفصل جزء المخ الأيمن عن الأيسر!\n" +
                "\n" +
                "وهناك من قال إن الاكتئاب أو المرض النفسي عامة من الذنوب التي يحتاج الشخص إلى أن يتطهر منها.. فكانوا يستخدمون مواد تسبب النزيف أو الإسهال حتى يتطهر المريض من أي شيء عنده.\n" +
                "ومن قال إن الاكتئاب أصلًا بسبب الطعام.. فنحن نحتاج إلى اختيار الأطعمة الصحية التي تمنع ذلك.. ونأخذ حقنًا لكي تخلص الجسم من الطعام المسبب للاكتئاب عن طريق الإسهال.. ماذا؟ ما حكايتكم مع الإسهال!",
                "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D9%83%D9%8A%D9%81%20%D8%AA%D9%82%D9%87%D8%B1%20%D8%A7%D9%84%D8%A7%D9%83%D8%AA%D8%A6%D8%A7%D8%A8%D8%9F%20--%E2%80%8D--%D9%83%D8%AA%D8%A7%D8%A8%20%D8%A7%D9%84%D9%83%D9%84%D8%A8%20%D8%A7%D9%84%D8%A7%D8%B3%D9%88%D8%AF%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=73d88241-8c77-4739-b6d7-4d6db33f7433"
                ,false));
        books.add(new Books("https://uploads-ssl.webflow.com/5da07a237543165e75492146/5db8b17e97feba59e0bf4e01_Atomic%20Habits%20Book%20Cover-min.jpg"
                , "كتاب العادات الذرية"
                , "James Clear"
                , "استيقظت من النوم أمس أريد تغيير حياتي كلها، أريد النوم باكرًا، وأستيقظ باكرًا، وأمارس تمارين رياضية وآكل طعامًا صحيًّا!\n" +
                "وبدأت في تخيل نفسي بعد إنهاء مذاكرتي وأحصل جائزة نوبل في الانضباط!\n" +
                "\n" +
                "وفي اليوم استيقظت الساعة 4………عصرًا!\n" +
                "تضايقت قليلًا لأن اليوم ضاع ولكني قررت قتها أن أفهم كيف نجح الأشخاص الناجحون؟ كيف يفعلون كل ما يفعلون من أشياء صحيحة دون ملل؟\n" +
                "إلى أن وقع في يدي كتاب \"العادات الذرية\"، وفهمت منه أن الحماس ليس كافيًا لتغيير أي عادات سيئة في حياتنا وبناء عادات أخرى جيدة مكانها! فهناك أمور مهمة في تكوين العادات أو التخلص منها لا بد من السير عليها.. ولكن ما هذه الأمور؟\n" +
                "\n" +
                "\n" +
                "حلقة اليوم مبنية على كتاب (العادات الذرية) لـ James Clear وسنعرف فيها كيف يمكن للتغييرات البسيطة المنتظمة التي لن تستغرق منك أي وقت، أن تكون هي السبب في النجاحات العظيمة التي ستحققها! تستطيع سماع الحلقة على تطبيق أخضر من هاتفك وستجد فيه ملخصات للكتب العالمية والعربية في 16 قسم مختلف وفي أقل من 15 دقيقة. ",
                "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%A7%D9%84%D8%A7%D9%86%D8%B3%D8%A7%D9%86%20%D8%A7%D9%8A%D9%87%20%D8%BA%D9%8A%D8%B1%20%D8%B4%D9%88%D9%8A%D8%A9%20%D8%B9%D8%A7%D8%AF%D8%A7%D8%AA%20------%E2%80%8D----%20%D8%8C%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%A7%D9%84%D8%B9%D8%A7%D8%AF%D8%A7%D8%AA%20%D8%A7%D9%84%D8%B0%D8%B1%D9%8A%D8%A9%20%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=45bdb3dc-9325-4917-9363-286c44c1fa54"
                ,true));


        books.add(new Books("https://i.pinimg.com/originals/d0/1c/db/d01cdbfb458b42976d268982db5b2ae7.png"
                , "عبادة المشاعر\n"
                , "ميشيل لكروا"
                , "ما آخر حدث رائج تتذكره أو حدث كبير كان الناس جميعًا يتحدثون عنه؟ مباراة الأهلي والزمالك الأخيرة، حرائق أستراليا ، زواج هاري وميغان، التعاطف مع ضحايا تفجير مرفأ بيروت، لا يمر أسبوع من دون حدث كبير يتحدث عنه الناس، وإن لم يكن حدثًا كبيرًا ويستحق، فلدينا بدلًا من الحدث الرائج 100، وإن لم يكن بالمستوى المطلوب، فهناك دراما وسينما وأنشطة ترفيهية تخلق الدراما والإثارة بأعلى مستوى!\n" +
                "\n" +
                "والفيلم الناجح أصبح هو الذي يستطيع اللعب على مشاعرك، إن شعرت برعشة الخطر، يهدئك بجرعة حنان، عندما تضحك يدفعك إلى البكاء، هذا شخص شرير تكرهه، ثانية.. من هذا الشخص الذي أصبحت متعاطفًا معه؟! وهكذا بشكل مستمر هو قادر على جذبك طوال الوقت.\n" +
                "\n" +
                "هذا شيء مدروس بالمناسبة، المسوّقون يعرفون أن أكثر شيء يحقق مبيعات هو اللعب على المشاعر، يمكنك إيقاف الفيديو لثوان، وتذكر ما أكثر إعلانات كنت تحبها وتعلق في ذهنك في آخر بضع سنوات؟\n" +
                "\n" +
                "هل لاحظت ما المشترك بينها؟  غالبًا كلها تركز على جانب عاطفي يلمسك، فرحة، مشاركة، تجمع عائلي، مع أنها منتجات مادية عادية. \n" +
                "\n" +
                "لكن ليس هذا فقط، فالمشاعر أصبحت طقسًا، مثل الهالووين، كما أن هناك تيارات اجتماعية كثيرة أصبحت تحاول إضافة جانب عاطفي قوي على الوجود الإنساني، مثل حركة العصر الجديد التي تدعو إلى الاندماج مع الكون وجعل الأحاسيس هي أساس المعرفة، وحتى كتب التطوير الذاتي تقول \"حرر طاقتك الشعورية\". \n" +
                "\n" +
                "هذا كله يقول شيئًا واحدًا فقط، إن المشاعر عائدة بقوة، وإننا في عصر يقدس المشاعر، ولكن هل هذه العودة في صالحنا؟ وهل هناك استخدام جيد وسيئ للمشاعر؟ وما أسباب عودتها؟ ولماذا نقول رجوع أصلًا، هل كانت المشاعر مختفية قبل ذلك؟!\uD83D\uDE33"
                ,"https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%AA%D9%82%D8%AF%D9%8A%D8%B3%20%D8%A7%D9%84%D9%85%D8%B4%D8%A7%D8%B9%D8%B1--%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%B9%D8%A8%D8%A7%D8%AF%D8%A9%20%D8%A7%D9%84%D9%85%D8%B4%D8%A7%D8%B9%D8%B1%20--%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=1f753099-ceb4-462c-a289-e3bf29d0a85c"
                ,false));


        books.add(new Books("https://books-library.net/files/books-library.online_nood34d704855c29f6a60b310-7415stm.jpg"
                , "الحزن الخبيث"
                , "لويس ولبرت\n" +
                "\n"
                , "هذا أندرو سولومان، كاتب أمريكي يحب رياضة القفز من الطائرات ويمارسها، أي أنه رجل شجاع جدًّا وقلبه ميت، في المقابل هذا أندرو سولومان لكن ما يُحكي أنه في مرة كان نائمًا على فراشه ويريد أن يذهب إلى الحمام ولا يستطيع، لماذا؟ لأنه كان خائفًا جدًّا! ويعدّ كم خطوة سيحتاج لكي يصل من السرير إلى الحمام، وكل أمنيته في الحياة أن حد يساعده شخص ما ويفتح له الباب من شدة خوفه، هذان ليسا شخصين مختلفين إنهما الشخص ذاته، لكن الأول في حالته الطبيعية، والثاني عندما كان مصابًا باكتئاب حاد!\n" +
                "\n" +
                "لويس ولبرت، وهو مؤلف الكتاب الذي سنتكلم عنه، والذي كان هو الآخر مصابًا باكتئاب حاد، يقول عن هذه التجربة: \"كانت تلك أسوأ تجربة في حياتي، وربما أسوأ من مأساة وفاة زوجتي بمرض السرطان، وكم يخجلني الاعتراف أن تجربتي مع الاكتئاب كانت أسوأ من مشاهدة زوجتي تموت بالسرطان، لكنها الحقيقة التي لا يمكن إنكارها، لقد كنت في حالة لا تشبه أي حالة مررت بها من قبل، فليست تلك حالة من الخمول أو الهبوط العام، ولم أكن محبطًا بالمعنى الشائع للكلمة، بل كنت مريضًا بالفعل.\" \n" +
                "\n" +
                "الاكتئاب الحاد تجربة من المستحيل أن يتخيلها إلا من مر بها،  وكثيرون منا لا يستطيعون فهم المرض العقلي أو النفسي لأن سببه غير ملموس مثل المرض الجسدي، وهذا ما يحاول الكتاب إفهامه لنا، ترى ما الذي قد يوصل شخصًا مثل أندرو من هذه الحالة إلى تلك؟ ولماذا يصاب أشخاص دون غيرهم بالاكتئاب؟ وما الفرق بين الاكتئاب والحزن العادي؟ وهل أسبابه نفسية أم عضوية؟ وهل يمكن علاج الاكتئاب؟ ",
                "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%B4%D8%A8%D8%AD%20%D8%A7%D9%84%D8%A7%D9%83%D8%AA%D8%A6%D8%A7%D8%A8%20----%D8%8C%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%A7%D9%84%D8%AD%D8%B2%D9%86%20%D8%A7%D9%84%D8%AE%D8%A8%D9%8A%D8%AB%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=7c294ac1-dafe-4cf9-a92d-0b779cb70b26"
                ,true));
        books.add(new Books("https://books-library.net/files/books-library.online_nood34d704855c29f6a60b310-7415stm.jpg"
                , "الارتجال … كسب الناس والجماعات بالعفوية"
                , "روبرت لوى\n"
                ,"الارتجال هو أسلوب وطريقة تفكير تسمح لك بالتواصل مع الآخرين بصورة فعالة.\n" +
                "\n" +
                "هو أداة وعملية تنقل من خلالها خبراتك للآخرين وجهًا لوجه، وهو مهارة مهمة جدًا في الحياة الاجتماعية والعمل؛ لأنه يمكنك من الاستفادة من اللحظة الحالية ويساعدك على كسب الناس والاستفادة منهم وافادتهم بأكبر صورة ممكنة، ولحسن الحظ فالارتجال علم وفن؛ وهو ما يعني أن بإمكانك اكتسابه أو تعليمه لغيرك أيضًا.",
                "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D9%83%D9%8A%D9%81%20%D8%AA%D9%83%D9%88%D9%86%20%D9%85%D8%AA%D8%AD%D8%AF%D8%AB%D9%8B%D8%A7%20%D8%A8%D8%A7%D8%B1%D8%B9%D9%8B%D8%A7%20-%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%A7%D9%84%D8%A7%D8%B1%D8%AA%D8%AC%D8%A7%D9%84(MP3_128K).mp3?alt=media&token=f2597b30-9b17-4893-8a53-9cb6c04e1c95"
                ,true));
        books.add(new Books("https://i.ebayimg.com/images/g/5SoAAOSw0YBgAFIg/s-l300.jpg"
                , "زوج صالح.. زواج ناجح"
                , "Robert Mark Alter"
                , "أخي المسكين.. تخيل نفسك جالسًا في يوم تشرب كوبًا من الشاي، وكل ما ترجوه ألا يفسد عليك أحدهم لحظة الهدوء هذه، ثم تدخل عليك امرأتك -ستقول لي لكني لست متزوجًا- سأقول لك= تخيل يا أخي تخيل! وتجدها منهارة وتصرخ وتقول لك إنها كانت شُعلة منيرة قبل أن تتزوج بك وإنك قد أطفأتها!\n" +
                "ولسان حالك يقول: أنا يا بنتي؟ \n" +
                "\n" +
                "أخي الإنسان.. إننا نعلم أنك مسكين، ولا تقصد إطفاءها ولا أي شيء من هذا القبيل، لكنها لن تتهمك بلا سبب! \n" +
                "\n" +
                "فتعال أبسط الأمر لك.. وأقول لك ما الذي يجعلك تعيش ملكًا في حياتك الزوجية، وما الذي يجعل زواجك مثاليًّا ويجعل زوجتك أفضل زوجة في الدنيا."
                ,"https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D9%83%D9%8A%D9%81%20%D8%A8%D8%AF%D8%A3%20%D8%A7%D9%84%D9%86%D9%83%D8%AF%D8%9F%20--%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%B2%D9%88%D8%AC%20%D8%B5%D8%A7%D9%84%D8%AD..%20%D8%B2%D9%88%D8%A7%D8%AC%20%D9%86%D8%A7%D8%AC%D8%AD%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=048b8e3d-63ea-4892-b26d-eb696aba0dee"
                ,false));

        books.add(new Books("https://pbs.twimg.com/media/DzfE3_HWoAAZDF_.jpg"
                , "الإتقان"
                , "Robert Greene"
                , "هل تظن أن آينشتاين وتوماس أديسون ونيوتن وغيرهم من العباقرة وصلوا إلى ما وصلوا إليه لأن أدمغتهم كانت مختلفة عن أدمغتنا أم أننا نمتلك نفس قدراتهم؟ \n" +
                "\n" +
                "- نفس قدراتهم؟! كيف ذلك؟!\n" +
                "\n" +
                "أتعرف أنك تبني الآن سورًا بينك وبين العظمة والإبداع؟ عندما تعتقد أنه لا أحد يستطيع الوصول إلى العبقرية لأنها موهبة يولد بها الشخص، أو تراها سرًّا يصعب على أي أحد الوصول إليه = فإنك تضيف حجرًا إلى السور الذي بينك وبينها، وكل خرافة تعتقدها عن العبقرية هي حجر يرفع السور بينك وبينها.\n" +
                "\n" +
                "صديقي (غير العبقري)، تعال لنذهب في رحلة نعرف فيها كيف تكون عبقريًّا ولامعًا في أي شيء من البداية إلى النهاية. "
                , "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%A7%D8%B2%D8%A7%D9%8A%20%D8%AA%D8%A8%D9%82%D9%8A%20%D8%B9%D8%A8%D9%82%D8%B1%D9%8A_%20--%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%A7%D9%84%D8%A5%D8%AA%D9%82%D8%A7%D9%86%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=4092f95d-bd89-4754-8267-e810cf4ba06f"
                , true));
        books.add(new Books("https://www.bostanekotob.com/wp-content/uploads/2021/06/22-77-197x313-1.jpg"
                , "محاط بالحمقى"
                , "توماس إريكسون"
                , "هذا هو السيد red  وهذا هو السيد yellow وهذا السيد green وهذا السيد blue، وهؤلاء هم أبطال حلقة اليوم، أما هذه فقطع أثاث مكونة من أجزاء عدة ونريد أن نركبها، وسنعطي لكل واحد منهم قطعة وننظر كيف سيركبها.\n" +
                "السيد red واثق جدًّا أنه سيركبها بسهولة، فبدأ بتجميع القطع المختلفة فورًا دون أن ينظر إلى باقي القطع في الكرتونة، وكان أسرعهم في الانتهاء، أما السيد yellow فمتحمس جدًّا ويصدر ضجيجًا في أثناء تركيبه لكل قطعة في كل مكان بشكل عشوائي، وذهنه يركز على الصورة النهائية للأثاث بعد تركيبه وكيف سيكون جميلًا، السيد blue بحث عن كتيب التعليمات وقرأه جيدًا، مرتين، وعدّ القطع، وتأكد أنها مطابقة للصور، ثم بدأ التركيب حسب ما يقول كتيب التعليمات، وقد استغرق وقتًا طويلًا جدًّا لكن النتيجة كانت مثالية، أما بقى السيد green فوضع الكرتونة بجوار الحائط وأحضر كوبًا من الشاي وجلس ليستريح قليلًا، فالوقت أمامنا طويل. ^^\n" +
                "\n" +
                "هؤلاء الأربعة يمثلون اختلاف أنماط شخصياتنا بوصفنا بشرًا، ويشرح كتاب اليوم الفروق بينها وما الطريقة المثل للتعامل مع كل نمط منها.",
                "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%A7%D8%B2%D8%A7%D9%8A%20%D8%AA%D9%82%D8%B1%D8%A3%20%D8%A7%D9%84%D9%84%D9%8A%20%D9%82%D8%AF%D8%A7%D9%85%D9%83%20--%20%D9%83%D8%AA%D8%A7%D8%A8%20%D9%85%D8%AD%D8%A7%D8%B7%20%D8%A8%D8%A7%D9%84%D8%AD%D9%85%D9%82%D9%89%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=df23044c-83e8-488b-9a19-a594c474555f"
                , true));
        books.add(new Books("https://abjjadst.blob.core.windows.net/pub/d6a909ae-f2f8-4d02-9160-79933df829ab.png"
                , "خراب: كتابٌ عن الأمل"
                , "Mark Manson"
                , "تذكر يا أخي الإنسان عندما كان جدك يقول لك: هل رأيتم خيرًا في أيامكم هذه أو عشتم شيئًا جيدًا؟ لقد كانت أيامنا أيام عز!\n" +
                "\n" +
                "لا تصدقه! أنا سأخبرك بالحقيقة يا أيها الإنسان المرفه المرتاح: إن الإنسان قديمًا كان مسكينًا! كان يموت من كل شيء، من الأمراض المنتشرة والعدوى والمجاعات، كان يمكن لمجموعة من الناس أن يدخلوا أرضك ويقتلوك لكي يأخذوها، كان العمل بالسُخرة والاستعباد والعنصرية، وكانت هناك سجون ومحارق جماعية وحروب عالمية، والآن تطور العلم.. وقلت نسب الوفيات بسبب الأمراض المجهولة، لأننا أصبحنا نكتشفها ونكتشف علاجًا لها، وكما قلت نسب الحروب عن ذي قبل، وأصبح هناك أخلاقيات وحرية لكل شخص لا يمكن تخطيها ومعاهدات سلام، وإنترنت سهل التواصل بين كل دول العالم، وروبوتات واختراعات جديدة، حتى الإناث اللائي لم يكنّ ينلن حقوقهن أصبحن يعملن في كل الوظائف وينلن حقوقهن كاملة. :\"D "
                , "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/Media%2F%D8%A7%D9%84%D8%A3%D9%85%D9%84%20%D8%A7%D9%84%D9%88%D8%AD%D9%8A%D8%AF%20%D9%84%D9%84%D9%86%D8%AC%D8%A7%D8%A9%20%E2%9A%A0%EF%B8%8F%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%AE%D8%B1%D8%A7%D8%A8%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=d85181b6-17cb-4e51-8773-34d7796cc4e8"
                , false
        ));
        books.add(new Books("https://insdrcdn.com/media/attachments/d/17/a4defd17d.jpg"
                , "الهدوء"
                , "سوزان كين"
                , "ما أول شيء يخطر في بالك عندما تسمع كلمة انطوائي؟ شخص هزيل ووجهه نحيف، منعزل، ولا يحب التجمعات ويهرب من المناسبات الاجتماعية، وكلامه محدود.\n" +
                "\n" +
                "بيل جيتس صاحب مايكروسوفت، جي كي كاتبة سلسلة هاري بوتر، وجورج أورويل صاحب رواية مزرعة الحيوانات، وأينشتاين، ونيوتن.. ثانية، ما علاقة كل هذه الأسماء بموضوعنا؟\n" +
                "\n" +
                "سأخبرك، أنهم جميعًا انطوائيون، وليسوا هم فقط، ولكن كثيرًا من المخترعين والفنانين والفلاسفة والأدباء في كل المجالات تقريبًا يصنفون أنهم أشخاص انطوائيون، غير أن الإحصائيات تقول إن شخصًا من كل 3 أشخاص يميل للانطوائية!  فانظر في عائلتك وأصدقائك كم واحدًا ميالًا للانطوائية.\n" +
                "\n" +
                "هذا يجعلنا نسأل ما معنى انطوائي أصلًا؟ وهل هو نفس المعنى الذي نفهمه جميعًا أم أننا يمكن أن نكون مخطئين في الفهم؟ وهل معنى أن الأشخاص العظام الذين سبق ذكرهم انطوائيون أن الانطواء حسن؟ أم أنه سيئ كما كنا نظن طوال حياتنا؟ أم إن له ما له وعليه ما عليه؟  \n" +
                "\n" +
                "حلقة اليوم مبنية على كتاب (قوة الانطوائيين في عالم لا يتوقف عن الكلام)، التي سنجيب فيها عن كل هذه الأسئلة، تستطيعون أن تسمعوها وتحملوها على تطبيق أخضر سواء كان هاتفك IOS أو آندرويد بالإضافة إلى كثير من الملخصات في 16 قسم مختلف.",
                "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%B9%D8%B8%D9%8A%D9%85%20%D9%88%D9%84%D9%83%D9%86%20%D8%A7%D9%86%D8%B7%D9%88%D8%A7%D8%A6%D9%8A%20_%20--%20%D9%85%D9%84%D8%AE%D8%B5%20%D9%83%D8%AA%D8%A7%D8%A8%20%D8%A7%D9%84%D9%87%D8%AF%D9%88%D8%A1%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=8284bfa7-8e72-434d-a07f-096396a8d56f"
                ,true));
        books.add(new Books("https://books-library.net/files/books-library.online_noof6838d6ada68cfceece614-85stm.jpg"
                , "معرفة الإنسان من نظرة."
                , "فرانك م. شيلين"
                , "هذا (هاني) وهذه (تهاني)، كلاهما في نفس المستوى من حيث الخبرة والمعرفة والمهارات، كلاهما قدم للعمل في نفس الشركة، وأجرت الشركة لهما مقابلة عمل واحدة.\n" +
                "\n" +
                "(هاني) يجلس هادئًا ومستقرًّا في المقابلة، و(تهاني) كانت متوترة وعصبية، لأن مسؤول التوظيف الذي أجرى المقابلة معهما كان قليل الكلام، وسألهما أسئلة مختصرة ومحددة جدًّا، ولم يظهر على وجهه أي ردود فعل.\n" +
                "\n" +
                "فهي لا تستطيع تقييم شخصيته أو تعرف نفسيته. \n" +
                "\n" +
                "كما لا تعرف كيف قيمها وعلى أي أساس، وبسبب اضطرابها ظلت تتكلم وتتكلم.\n" +
                "\n" +
                "على عكس (هاني).\n" +
                "\n" +
                "استطاع أن يتكلم مع مسؤول التوظيف بسرعة، ويجيب بجمل مختصرة ومفيدة. \n" +
                "\n" +
                "ولم يخرج عن هدوئه على الرغم من برود انفعالات المسؤول، لأن (هاني) فهم أن هذا التصرف السلبي ليس موجهًا ضده كشخص، لكنه نمط الشخص اللي يجري معه الحوار وهذه شخصيته. \n" +
                "\n" +
                "في رأيك من سيكون الأقدر على كسب الوظيفة؟ هاني أم تهاني؟ \n" +
                "\n" +
                "بالتأكيد هاني، تعالوا نعرف لماذا تفوق هاني على تهاني، وكيف نستطيع قراءة الشخص الذي أمامنا ونعرف شخصيته وطبيعته من أول نظرة كما فعل هو. "
                , "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D8%A3%D9%86%D9%85%D8%A7%D8%B7%20%D8%A7%D9%84%D8%B4%D8%AE%D8%B5%D9%8A%D8%A9%20%D8%A7%D9%844--------%20_%20%D9%83%D8%AA%D8%A7%D8%A8%20%D9%85%D8%B9%D8%B1%D9%81%D8%A9%20%D8%A7%D9%84%D8%A5%D9%86%D8%B3%D8%A7%D9%86%20%D9%85%D9%86%20%D9%86%D8%B8%D8%B1%D8%A9%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=fc7220b5-4feb-4d20-a34c-744725a6da5a"
                , false));


        books.add(new Books("https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/images%2Fbook1.png?alt=media&token=a859a636-9700-4a05-9564-321f91cf70b5"
                , "تكلم بدون خوف"
                , "فآيفي نايشتادت"
                , "ما أول شيء يخطر في بالك عندما تسمع كلمة انطوائي؟ شخص هزيل ووجهه نحيف، منعزل، ولا يحب التجمعات ويهرب من المناسبات الاجتماعية، وكلامه محدود.\n" +
                "\n" +
                "بيل جيتس صاحب مايكروسوفت، جي كي كاتبة سلسلة هاري بوتر، وجورج أورويل صاحب رواية مزرعة الحيوانات، وأينشتاين، ونيوتن.. ثانية، ما علاقة كل هذه الأسماء بموضوعنا؟\n" +
                "\n" +
                "سأخبرك، أنهم جميعًا انطوائيون، وليسوا هم فقط، ولكن كثيرًا من المخترعين والفنانين والفلاسفة والأدباء في كل المجالات تقريبًا يصنفون أنهم أشخاص انطوائيون، غير أن الإحصائيات تقول إن شخصًا من كل 3 أشخاص يميل للانطوائية!  فانظر في عائلتك وأصدقائك كم واحدًا ميالًا للانطوائية.\n" +
                "\n" +
                "هذا يجعلنا نسأل ما معنى انطوائي أصلًا؟ وهل هو نفس المعنى الذي نفهمه جميعًا أم أننا يمكن أن نكون مخطئين في الفهم؟ وهل معنى أن الأشخاص العظام الذين سبق ذكرهم انطوائيون أن الانطواء حسن؟ أم أنه سيئ كما كنا نظن طوال حياتنا؟ أم إن له ما له وعليه ما عليه؟  \n" +
                "\n" +
                "حلقة اليوم مبنية على كتاب (قوة الانطوائيين في عالم لا يتوقف عن الكلام)، التي سنجيب فيها عن كل هذه الأسئلة، تستطيعون أن تسمعوها وتحملوها على تطبيق أخضر سواء كان هاتفك IOS أو آندرويد بالإضافة إلى كثير من الملخصات في 16 قسم مختلف. "
                , "https://firebasestorage.googleapis.com/v0/b/ansys-c19a7.appspot.com/o/%D9%83%D8%AA%D8%A7%D8%A8%20%D8%AA%D9%83%D9%84%D9%85%20%D8%A8%D8%AF%D9%88%D9%86%20%D8%AE%D9%88%D9%81%20--%20_%D8%A3%D8%AE%D8%B6%D8%B1(MP3_128K).mp3?alt=media&token=74b06b3a-6a26-484b-a730-3561a642735c"
                , false));


        return books;
    }

}
